{
  "intents": [
    {
      "tag": "greeting",
      "patterns": [
        "Hi",
        "Hello",
        "Good day",
        "Hey there",
        "How are you?",
        "Is anyone there?",
        "Good morning",
        "Good afternoon"
      ],
      "responses": [
        "Hello! Welcome to the Airports Authority of India. How can I assist you today?",
        "Hi there! How can I help you with your travel needs?",
        "Greetings from AAI! What can I do for you today?",
        "Hello! How can I assist with your inquiries about Indian airports?"
      ]
    },
    {
      "tag": "goodbye",
      "patterns": [
        "Bye",
        "Goodbye",
        "See you later",
        "Thanks, bye",
        "Talk to you later"
      ],
      "responses": [
        "Goodbye! Thanks for visiting the Airports Authority of India.",
        "See you later! Safe travels from AAI.",
        "Bye! If you need more information, feel free to come back.",
        "Goodbye! Wishing you a pleasant journey."
      ]
    },
    {
      "tag": "thanks",
      "patterns": [
        "Thanks",
        "Thank you",
        "I appreciate it",
        "Thanks a lot",
        "Thank you so much"
      ],
      "responses": [
        "You're welcome! Glad to assist.",
        "Happy to help! Safe travels from AAI.",
        "Anytime! Have a great day ahead.",
        "My pleasure! Let me know if you need anything else."
      ]
    },
    {
      "tag": "about_aai",
      "patterns": [
        "What is AAI?",
        "Tell me about Airports Authority of India",
        "What does AAI do?",
        "What is the role of AAI?",
        "Can you explain what AAI is?"
      ],
      "responses": [
        "The Airports Authority of India (AAI) manages and operates civil aviation infrastructure in India. AAI provides Air Traffic Management (ATM) services over Indian airspace and adjoining oceanic areas, ensuring safe and efficient operations.",
        "AAI is responsible for creating, upgrading, maintaining, and managing civil aviation infrastructure both on the ground and in the airspace across India.",
        "AAI stands for Airports Authority of India, the organization that oversees all airport operations and air traffic management in India."
      ]
    },
    {
      "tag": "services",
      "patterns": [
        "What services does AAI provide?",
        "Tell me about AAI's services",
        "What facilities are available at Indian airports?",
        "What does AAI offer?",
        "Can you list the services provided by AAI?"
      ],
      "responses": [
        "AAI provides a wide range of services including airport management, air traffic control, cargo handling, and passenger amenities. Additionally, AAI ensures the development of airport infrastructure and implements safety measures across airports in India.",
        "The Airports Authority of India offers services like air traffic management, airport development, passenger facilitation, and cargo operations.",
        "AAI is responsible for providing safe and efficient air traffic services, managing airports, and enhancing passenger experiences at airports across India."
      ]
    },
    {
      "tag": "flight_information",
      "patterns": [
        "How can I check my flight status?",
        "Where can I find information about flight arrivals and departures?",
        "Is my flight on time?",
        "Can you help me with flight details?",
        "How do I know if my flight is delayed?"
      ],
      "responses": [
        "You can check the latest flight status on the AAI official website or mobile app. Just enter your flight number to get real-time updates on arrivals, departures, and delays.",
        "Flight information, including arrivals and departures, can be accessed on the Airports Authority of India's website under the 'Flight Information' section.",
        "To check if your flight is on time, visit the AAI website or use our mobile app for real-time updates."
      ]
    },
    {
      "tag": "airport_facilities",
      "patterns": [
        "What facilities are available at Indian airports?",
        "Does AAI provide lounges at airports?",
        "What amenities are available at airports?",
        "Are there Wi-Fi and charging stations at the airport?",
        "What services are available for passengers at airports?"
      ],
      "responses": [
        "Indian airports managed by AAI offer a variety of facilities including lounges, Wi-Fi, charging stations, duty-free shopping, dining options, and assistance for special needs passengers.",
        "AAI ensures that passengers have access to services such as baggage handling, lounges, Wi-Fi, and charging stations. Facilities may vary by airport.",
        "Passengers can enjoy amenities like comfortable lounges, free Wi-Fi, shopping and dining options, as well as medical assistance at major airports managed by AAI."
      ]
    },
    {
      "tag": "airport_security",
      "patterns": [
        "What are the security procedures at Indian airports?",
        "What should I know about airport security?",
        "Are there any security checks I should be aware of?",
        "What items are not allowed in my carry-on?",
        "What are the rules for liquids at airport security?"
      ],
      "responses": [
        "At Indian airports, all passengers must pass through security checks, which include baggage screening and metal detector scans. Certain items like sharp objects and large quantities of liquids are not allowed in carry-on luggage.",
        "AAI follows strict security protocols to ensure passenger safety. Please make sure to check the list of prohibited items before packing, and be prepared for baggage screening and personal checks.",
        "Security checks include scanning of carry-on and checked baggage, along with metal detectors and possible pat-downs. Liquids over 100ml are not permitted in carry-on luggage, and certain items are prohibited altogether."
      ]
    },
    {
      "tag": "lost_and_found",
      "patterns": [
        "I lost something at the airport, what should I do?",
        "How do I report lost items?",
        "Where can I find lost and found?",
        "I left my bag at the airport, can you help?",
        "How can I recover my lost items?"
      ],
      "responses": [
        "If you’ve lost something at the airport, you can visit the Lost and Found department at the respective airport or contact AAI’s customer service for assistance.",
        "To report lost items, visit the Lost and Found section of the airport or contact the airport’s customer service. You can also report it online via the AAI website.",
        "Lost and Found services are available at all major airports. Please provide detailed information about the lost item for assistance."
      ]
    },
    {
      "tag": "contact_information",
      "patterns": [
        "How do I contact AAI?",
        "What is the customer service number for AAI?",
        "Can you give me the contact details for AAI?",
        "I need to speak with someone at AAI, how can I reach them?",
        "Where can I find AAI’s contact information?"
      ],
      "responses": [
        "You can contact AAI through their customer service number available on the official website or by visiting the 'Contact Us' section on the AAI website for detailed contact information.",
        "For inquiries, you can call the AAI customer service hotline listed on their website or reach out via email or social media channels.",
        "AAI's contact details, including customer service numbers and email addresses, can be found in the 'Contact Us' section of their official website."
      ]
    },
    {
      "tag": "careers",
      "patterns": [
        "How can I apply for a job at AAI?",
        "Are there any job openings at AAI?",
        "What is the recruitment process at AAI?",
        "Can you guide me on how to join AAI?",
        "Where can I find information on careers at AAI?"
      ],
      "responses": [
        "You can find job openings and apply for positions at AAI through the Careers section on the official AAI website. Keep an eye out for announcements and recruitment notices.",
        "AAI posts job openings on their official website under the Careers section. The recruitment process typically involves an online application, written exams, and interviews.",
        "For career opportunities at AAI, visit the Careers page on their website where you can find the latest job postings and application guidelines."
      ]
    },
    {
      "tag": "chatbot_capabilities",
      "patterns": [
        "What can you do?",
        "What can this chatbot do?",
        "How can you help me?",
        "What services do you offer?",
        "What kind of assistance can you provide?"
      ],
      "responses": [
        "I can assist you with a variety of tasks related to the Airports Authority of India. This includes providing information about AAI services, checking flight statuses, answering questions about airport facilities, guiding you through security procedures, and more.",
        "As your virtual assistant, I can help you with inquiries about AAI, flight information, airport facilities, lost and found services, and other general questions about Indian airports.",
        "I’m here to assist you with information on AAI services, flight details, airport amenities, and more. Just ask, and I’ll do my best to help!",
        "I can help you find information on flight status, airport facilities, contact details, and other services provided by the Airports Authority of India. How can I assist you today?"
      ]
    }
  ]
}
